---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipingSystem.GetPumpSets
source: html/2a46ea1c-73e9-a258-4ad4-239a9011f7e9.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystem.GetPumpSets Method

Gets the set of element Id's for all pump sets in the system, if any.

## Syntax (C#)
```csharp
public ISet<ElementId> GetPumpSets()
```

## Returns
The set of all the pump sets in the system.